In [44]:
import pandas as pd

In [60]:
deptDB = pd.read_csv('C:/_WsHongik20210507/data/deptDB.csv' ,names = ['deptno','dname','loc'],header=None)

In [46]:
sawonDB = pd.read_csv('./data/sawonDB.csv',names = ['sabun','saname','deptno','sajob','sapay','sahire','sasex','samgr'],header=None)

In [47]:
gogek = pd.read_csv("./data/gogekDB.csv",names = ['gobun','goname','gotel','gojumin','godam'],header=None)

In [48]:
deptDB['dname'] =deptDB['dname'].str.strip("' ")

In [49]:
deptDB['loc'] =deptDB['loc'].str.strip("' ")

In [50]:
sawonDB['saname'] =sawonDB['saname'].str.strip("' ")

In [26]:
deptDB.columns

Index(['deptno', 'dname', 'loc'], dtype='object')

In [57]:
deptDB

   deptno dname loc
0      10   총무부  서울
1      20   영업부  대전
2      30   전산부  부산
3      40   관리부  광주

In [66]:
deptSawon = deptDB.merge(sawonDB, how='outer',on = 'deptno')
deptSawon.head(2)

,deptno,dname,loc,sabun,saname,sajob,sapay,sahire,sasex,samgr
0,10,'총무부','서울',1.0,홍길동,'회장',5000.0,'1980/01/01','남자',null
1,10,'총무부','서울',13.0,무궁화,'부장',3000.0,'1996/11/01','여자',1

In [63]:
deptSawon = deptDB.merge(sawonDB, how='inner',on = 'deptno')
deptSawon.head(2)

,deptno,dname,loc,sabun,saname,sajob,sapay,sahire,sasex,samgr
0,10,'총무부','서울',1,홍길동,'회장',5000,'1980/01/01','남자',null
1,10,'총무부','서울',13,무궁화,'부장',3000,'1996/11/01','여자',1

In [62]:
deptSawon = deptDB.merge(sawonDB, how='right',on = 'deptno')
deptSawon.head(2)

,deptno,dname,loc,sabun,saname,sajob,sapay,sahire,sasex,samgr
0,10,'총무부','서울',1,홍길동,'회장',5000,'1980/01/01','남자',null
1,10,'총무부','서울',13,무궁화,'부장',3000,'1996/11/01','여자',1

In [59]:
#문제 7] sawonDB 데이터에서 전산부 직원의 평균연봉 출력
q7_com_30 = deptSawon[deptSawon['dname'] =='전산부']
sa_pay_30 = q7_com_30['sapay'].mean()
print(sa_pay_30)

1959.7142857142858